#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker]
azurerm_service_plan.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Web/serverfarms/plan-nbn-location-checker]
azurerm_application_insights.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Insights/components/appi-nbn-location-checker]
azurerm_storage_account.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Storage/storageAccounts/stfuncnbnlocationchecker]
azurerm_storage_container.app: Refreshing state... [id=https://stfuncnbnlocationchecker.blob.core.windows.net/content]
azurerm_storage_blob.app: Refreshing state... [id=https://stfuncnbnlocationchecker.blob.core.windows.net/content/a82c404ced974e4e5ac356a252adaf3f41e973b7313aeb73c63e4854caf0157c.zip]
azurerm_linux_function_app.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Web/sites/func-nbn-location-checker]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_function_app.app will be updated in-place
  ~ resource "azurerm_linux_function_app" "app" {
      ~ app_settings                      = {
          ~ "WEBSITE_RUN_FROM_PACKAGE"   = (sensitive)
            # (2 unchanged elements hidden)
        }
        id                                = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Web/sites/func-nbn-location-checker"
        name                              = "func-nbn-location-checker"
        tags                              = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # azurerm_storage_blob.app must be replaced
-/+ resource "azurerm_storage_blob" "app" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://stfuncnbnlocationchecker.blob.core.windows.net/content/a82c404ced974e4e5ac356a252adaf3f41e973b7313aeb73c63e4854caf0157c.zip" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "a82c404ced974e4e5ac356a252adaf3f41e973b7313aeb73c63e4854caf0157c.zip" -> "867cf96be19f39edf7eb85637b3d712b7ea9c5a870ef90ab7afbfd00e7352040.zip" # forces replacement
      ~ url                    = "https://stfuncnbnlocationchecker.blob.core.windows.net/content/a82c404ced974e4e5ac356a252adaf3f41e973b7313aeb73c63e4854caf0157c.zip" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @scottmckenzie, Action: `pull_request`*